In [2]:
import numpy as np
import pandas as pd

Series

In [3]:
pd.Series ([1000, 1500, 2000, 2500, 3000, 4000, 4500])

0    1000
1    1500
2    2000
3    2500
4    3000
5    4000
6    4500
dtype: int64

In [4]:
pd.Series([1200., 2000., 3000., 4000.])

0    1200.0
1    2000.0
2    3000.0
3    4000.0
dtype: float64

In [5]:
pd.Series([1200, 2000., '3000', 4000])

0      1200
1    2000.0
2      3000
3      4000
dtype: object

In [6]:
revenues = pd.Series([555, 7000, 1980]) #assign revenues

In [7]:
revenues #memanggil revenus

0     555
1    7000
2    1980
dtype: int64

In [8]:
revenues.values

array([ 555, 7000, 1980], dtype=int64)

In [9]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

Series dan Index

In [13]:
pd.Series([10,20,30,40,50],
          index=['A','B','C','D','E'])

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [12]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"])
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [14]:
pd.Series({'Amsterdam': 10, 'Jakarta': 20, 'Magetan': 50})

Amsterdam    10
Jakarta      20
Magetan      50
dtype: int64

LIST : '[]' '[1,2,3,4,5] variable[index]
TUPLE : '()' (1,2,3,4,5)
Dict : '{}' key:value dict [key]

In [15]:
city_employee_count = pd.Series({'Amsterdam': 5, 'Tokyo': 8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [16]:
city_employee_count.values

array([5, 8], dtype=int64)

In [17]:
city_employee_count.index

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [18]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [21]:
'Tokyo' in city_employee_count

True

In [22]:
'New York' in city_employee_count

False

Data Frame Objects

In [25]:
pd.DataFrame({
    'revenue' : city_revenues,
    'employee_count' : city_employee_count
})

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [26]:
city_data = pd.DataFrame({
    'revenue' : city_revenues,
    'employee_count' : city_employee_count
})

In [27]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [28]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [29]:
city_data.values

array([[4.2e+03, 5.0e+00],
       [6.5e+03, 8.0e+00],
       [8.0e+03,     nan]])

In [30]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [31]:
city_data.axes[0]

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [32]:
city_data.axes[1]

Index(['revenue', 'employee_count'], dtype='object')

In [33]:
city_data.columns

Index(['revenue', 'employee_count'], dtype='object')

In [34]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [35]:
'Amsterdam' in city_data

False

In [36]:
'employee_count' in city_data

True

In [37]:
'revenue' in city_data

True

accessing series elements

In [38]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [39]:
city_revenues ['Amsterdam']

4200

In [41]:
city_revenues ['Toronto']

8000

In [44]:
city_revenues ['Tokyo']

6500

In [45]:
city_revenues [1]

8000

In [47]:
city_revenues [2]

6500

In [49]:
city_revenues [0]

4200

In [50]:
city_revenues [-1]

6500

In [55]:
city_revenues [-2]

8000

In [56]:
city_revenues [-3]

4200

In [58]:
city_revenues [1:]

Toronto    8000
Tokyo      6500
dtype: int64

In [59]:
city_revenues [:1]

Amsterdam    4200
dtype: int64

In [61]:
city_revenues['Toronto']

8000

In [62]:
colors = pd.Series (['red', 'purple', 'blue', 'green', 'yellow' ],
                    index=[1, 2, 3, 4, 5]
                   )

In [63]:
colors

1       red
2    purple
3      blue
4     green
5    yellow
dtype: object

In [64]:
colors[1]

'red'

In [65]:
colors.loc[1]

'red'

In [66]:
colors.iloc[1]

'purple'

In [67]:
colors.iloc[1:3]

2    purple
3      blue
dtype: object

In [72]:
city_revenues.iloc[1]

8000

In [74]:
city_data.revenue

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [75]:
city_data.employee_count

Amsterdam    5.0
Tokyo        8.0
Toronto      NaN
Name: employee_count, dtype: float64

In [77]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [80]:
city_data.loc['Amsterdam']

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [81]:
city_data.loc['Tokyo']

revenue           6500.0
employee_count       8.0
Name: Tokyo, dtype: float64

In [82]:
city_data.loc['Toronto']

revenue           8000.0
employee_count       NaN
Name: Toronto, dtype: float64

In [83]:
city_data.loc['Amsterdam': 'Tokyo', 'revenue']

Amsterdam    4200
Tokyo        6500
Name: revenue, dtype: int64

In [84]:
city_revenues.sum()

18700

In [85]:
city_revenues.max()

8000

In [86]:
further_city_data = pd.DataFrame(
    {'revenue': [7000, 3400], 'employee_count': [2, 2]},
    index=['New York','Barcelona']
)

In [87]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [88]:
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [90]:
all_city_data = pd.concat([city_data, further_city_data], sort=False)

In [91]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [92]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

In [93]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [94]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [95]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)

In [96]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
Toronto     8000.0             NaN   Canada      0.0
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0

In [97]:
cities = pd.concat([all_city_data, city_countries], axis=1, join='inner')

In [98]:
cities

           revenue  employee_count  country  capital
Amsterdam     4200             5.0  Holland        1
Tokyo         6500             8.0    Japan        1
Toronto       8000             NaN   Canada        0
Barcelona     3400             2.0    Spain        0

In [99]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

In [100]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [101]:
pd.merge(cities, countries, left_on='country', right_index=True)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200,5.0,Holland,1,17,Europe
Tokyo,6500,8.0,Japan,1,127,Asia
Toronto,8000,NaN,Canada,0,37,North America